In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('nba.csv')

In [6]:
df.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0,NaN,NaN
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0,NaN,NaN
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,NaN,NaN,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB

In [7]:
df.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
Bonus       float64
Sales       float64
dtype: object

In [8]:
df.head(4)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0,NaN,NaN
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0,NaN,NaN
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,NaN,NaN,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,06-May,185.0,Georgia State,1148640.0,NaN,NaN

In [9]:
df.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary', 'Bonus', 'Sales'],
      dtype='object')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB